orgdrillspacedrepetition.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-23 Sun 15:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-drill and spaced repetition</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="index.html">Cosmoi</a>
</div>
<div id="navigation">
<a href="index.html">Index</a>
<a href="about.html">About</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Org-drill and spaced repetition</h1>
<p>
When it comes to <a href="https://www.gwern.net/Spaced-repetition">spaced</a> <a href="https://codual.github.io/2016/07/07/repeticion-espaciada/">repetition</a> software, <a href="https://ankiweb.net/about">Anki</a> is probably the most
popular option. It is free software, provides syncronization with an
online server, has both desktop and Android applications, and it is
capable of rendering arbitrary Latex and multimedia. I would recommend
Anki to anyone starting with spaced repetition.
</p>

<p>
However, I do not myself use Anki; I have been using <a href="https://orgmode.org/worg/org-contrib/org-drill.pdf">org-drill</a> for a
few months. The primary reason being Emacs. I really like having all
the cards in plain text and editing them from the text
editor. Org-mode has latex and multimedia support, and most of my math
notes are already there. Its big drawback is that it currently cannot
be used directly from the mobile phone (<a href="https://termux.com/">Termux</a> is an option, but it
won't render Latex); a spaced repetition Android app supporting the
org-drill format would be great.
</p>

<p>
If you are not yet committed to Anki and you are already confortable
with Emacs, it could be a good idea to try both before settling on one.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited 2018-09-03 Mon 21:53. Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
